package com.stepic_tasks;

/**
 * Существует раздевалка в спортзале. Если в раздевалке находится женщина, то туда может
 * зайти только женщина. Если в раздевалке мужчина - то только мужчина. Если раздевалка
 * пустая, то туда может зайти любой желающий.
 * На двери есть индикатор, который может принимать 3 состояния:
 * 1) свободно
 * 2) раздевалка занята женщинами
 * 3) раздевалка занята мужчинами
 * Напишите программу, в которой мужчины и женщины смогут воспользоваться этой раздевалкой.
 * */
public class GymDressRoomTask {
}
